##############################################
# 配列の作り方
##############################################

# 空配列の作り方

hoge1 = []
p hoge1

# 初期値のある数値の配列の作り方

hoge2 = [1, 3, 5, 7]
p hoge2

# 初期値のある文字列の配列の作り方

hoge3 = %w(a i u e o)
p hoge3

# 初期値のあるシンボルの配列の作り方

hoge4 = %i(a i u e o)
p hoge4

##############################################
# 配列への追加
##############################################

# 演算子(<<)を使って配列を追加する

hoge5 = []
hoge5 << 1
p hoge5

# pushメソッドを使って配列を追加する

hoge6 = []
hoge6.push(1)
p hoge6
